{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentParameters.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspaceName": {
      "value": "azsec-shared-workspace"
    },
    "analyticsRuleDisplayName": {
      "value": "Monitor NSG Inbound Rule Updated to Allow All"
    },
    "analyticsRuleDescription": {
      "value": "This alert rule is used to monitor and alert if someone updates NSG inbound rule to allow All (*)."
    },
    "analyticsRuleSeverity": {
      "value": "Medium"
    },
    "analyticsRuleQuery": {
      "value": "AzureActivity \n| where OperationNameValue =~ \"Microsoft.Network/networkSecurityGroups/securityRules/write\"\n| where ActivityStatusValue == \"Accept\"\n| extend SourceAddressPrefix_ = tostring(parse_json(tostring(parse_json(tostring(Properties_d.responseBody)).properties)).sourceAddressPrefix),\n         SourceAddressPrefixes_ = tostring(parse_json(tostring(parse_json(tostring(Properties_d.requestbody)).properties)).sourceAddressPrefixes),\n         Access = tostring(parse_json(tostring(parse_json(tostring(parse_json(Properties).responseBody)).properties)).access),\n         Direction = tostring(parse_json(tostring(parse_json(tostring(Properties_d.responseBody)).properties)).direction),\n         NsgName = split(_ResourceId, '/')[8],\n         NsgRule = split(_ResourceId, '/')[10] \n| where SourceAddressPrefix_ == '*' or SourceAddressPrefixes_ == '' or SourceAddressPrefixes_ == '0.0.0.0/0' \n| where Access == \"Allow\"\n| where Direction == \"Inbound\"\n| project TimeGenerated, \n          NsgName, \n          NsgRule, \n          ResourceGroup, \n          SourceAddressPrefix_, \n          SourceAddressPrefixes_,\n          Caller,\n          CallerIpAddress,\n          _ResourceId"
    },
    "alertDisplayNameFormat": {
      "value": "A {{NsgName}} has inbound rule {{NsgRule}} updated to allow all"
    },
    "analyticsRuleTactics": {
      "value": [
        "InitialAccess"
      ]
    }
  }
}